---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.MEPFabricationFailures.FabricationPartInvalidSpecification
source: html/70692472-2092-faba-32f0-b969f700cf47.htm
---
# Autodesk.Revit.DB.BuiltInFailures.MEPFabricationFailures.FabricationPartInvalidSpecification Property

The part specification is invalid.

## Syntax (C#)
```csharp
public static FailureDefinitionId FabricationPartInvalidSpecification { get; }
```